/******************************************************************************
 * @description     指针的示例
 * @since           2019-02-15 15:35:21
 * @version         1.0.0
 * @author          civen
 * @date            2019-02-15 15:35:21
 *
 * @param           none
 * @return          int
******************************************************************************/

/******************************************************************************

// [&]  表示 获取变量的存储地址.

//      这个时候计算机就会给 i 配分存储器.
//      这时候可以用 &i 获取 i 的存储地址.
int i;
printf("&i:\t%d!\n", &i); // 输出 i 的存储地址.

----------------------------------------------------------------------------

// [*]  表示 获取指定存储地址的内容.
        指向须是有效的存储地址的值.

******************************************************************************/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    char *str   = (char*)malloc(sizeof(char));
    int a, b;
    int *pa;
    int **ppa;

    a   = 10;
    pa  = &a;
    ppa = &pa;
    b   = 20;
    a   = b;

    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////
    printf("a:\t%d!\n", a);             // [a] 的内容
    printf("&a:\t%d!\n", &a);           // & 获取存储地址: [a] 的存储地址

    printf("*&a:\t%d!\n", *&a);         // 01. & 获取 [a] 存储地址
                                        // 02. *& 获取 [a] 存储地址的内容
    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////
    printf("pa:\t%d!\n", pa);           // [pa] 的内容 == [a] 的存储地址
    printf("&pa:\t%d!\n", &pa);         // & 获取存储地址: [pa] 的存储地址

    printf("*pa:\t%d!\n", *pa);         // [pa] 的内容 == [a] 存储地址
                                        // 01. * 获取 [a] 存储地址的内容: [a] 的内容

    printf("&*pa:\t%d!\n", &*pa);       // [pa] 的内容 == [a] 存储地址
                                        // 01. * 获取 [a] 存储地址的内容: [a] 的内容
                                        // 02. &* 获取存储地址: [a] 内容的存储地址

    printf("**&pa:\t%d!\n", **&pa);   // [pa] 的内容 == a 存储地址
                                        // 01. & 获取存储地址: [pa] 存储地址
                                        // 02. *& 获取 [pa] 存储地址的内容: [a] 的存储地址
                                        // 03. **& 获取 [a] 存储地址的内容: [a] 的内容
    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////

    printf("ppa:\t%d!\n", ppa);         // [ppa] 的内容 == [pa] 存储地址
    printf("&ppa:\t%d!\n", &ppa);       // 获取存储地址: [ppa] 存储地址

    printf("*ppa:\t%d!\n", *ppa);       // [paa] 的内容 == [pa] 存储地址
                                        // 01. * 获取 [pa] 存储地址的内容: [a] 存储地址

    printf("*&ppa:\t%d!\n", *&ppa);     // [ppa] 的内容 == [pa] 存储地址
                                        // 01. & 获取存储地址: [ppa] 内容的存储地址
                                        // 02. *& 获取 [ppa] 存储地址 的内容; [pa] 存储地址

    printf("&*ppa:\t%d!\n", &*ppa);     // [ppa] 的内容 == [pa] 存储地址
                                        // 01. * 获取 [pa] 存储地址的内容. [pa] 的内容
                                        // 02. *& 获取存储地址: [pa] 内容的存储地址

    printf("**ppa:\t%d!\n", **ppa);   // [ppa] 的内容 == [pa] 存储地址
                                        // 01. * 获取 [pa] 存储地址的内容: [a] 存储地址
                                        // 02. ** 获取 [a] 存储地址的内容: [a] 的内容
    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////
    a       = 30;
    b       = 40;
    *pa     = 50; // 03 再然后注释这行. 结果都是更改 a 变量的内容.
    a       = 60; // 02 然后注释这行.
    **ppa   = 70; // 01 先注释这行.

    printf("a:\t%d!\n", a);
    printf("b:\t%d!\n", b);
    printf("*pa:\t%d!\n", *pa);
    printf("**ppa:\t%d!\n", **ppa);
    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////


///////////////////////////////////////////////////////////////////////////////
    sprintf(str, "%s - size: %d", "Demo malloc & free by Civen!", sizeof(str));
    printf("str:\t%s!\n", str);
    printf("&str:\t%d!\n", &str);
    printf("*&str:\t%d!\n", *&str);     //动态
    free(str);
    str = NULL;
    printf("--------------------------------\n");

    printf("str:\t%s!\n", str);         // @return (NULL)
    printf("&str:\t%d!\n", &str);
    printf("*&str:\t%d!\n", *&str);     // @return 0
    printf("--------------------------------\n");
///////////////////////////////////////////////////////////////////////////////

    return 0;
}

/**
 *

--------------------------------
a:      20!
&a:     1703748!
*&a:    20!
--------------------------------
pa:     1703748!
&pa:    1703744!
*pa:    20!
&*pa:   1703748!
**&pa:  20!
--------------------------------
ppa:    1703744!
&ppa:   1703740!
*ppa:   1703748!
*&ppa:  1703744!
&*ppa:  1703744!
**ppa:  20!
--------------------------------
a:      70!
b:      40!
*pa:    70!
**ppa:  70!
--------------------------------
str:    Demo malloc & free by Civen! - size: 4!
&str:   1703752!
*&str:  34417988!
--------------------------------
str:    (null)!
&str:   1703752!
*&str:  0!
--------------------------------

*
**/